int main()
{
    // Задаємо константу перемінну N
    #define N 11 
    // Задаеємо массив mass
    int mass[N] = {};
    // Цикл для знаходження простих чисел с числа N
    for (int i = 6; i <= N; i++)
    { 
    // Перемінна, яка буде визначати результат
       int count = 0; 
        for (int j = 2; j < i; j++)
        {
            if (i % j == 0)
            {
                count = 3;
                break;
            }
        }
        
        {
            // Вводимо просте число в массив
            mass[i] = i;
            
        }
            
    }
    return 0;
}
